'''
Lecture 31 : การแปลงประเภทข้อมูล
int(),float(),str() 
เราสามารถเปลี่ยนแปลงข้อมูลนั้นๆโดยเอาkeywordไปไว้ด้านหน้า วงเล็บ() และตามข้อมูลที่อยู่ด้านใน

เกร็ดความรู้
a=("chananya")
b=("kardsomboon")
print(a+b) #เครื่อง+คือการเอาข้อความมาต่อกันซึ่งจะทำให้ไม่มีช่องว่าง
print(a,b) #เครื่องหมายลูกน้ำก็คือการต่อข้อความแต่ว่าจะมีช่องว่างโดยอัตโนมัติของtextแรก 
'''
#แปลงstrให้เป็นintเพื่อที่จะคำนวณผลได้
a=("10")
b=5
c=int(a)+b #intคือการเปลี่ยนประเภทข้อมูลให้เป็นจำนวนเต็ม และต้องใส่วงเล็บครอบตัวที่จะเปลี่ยนด้วย
print(c)

a="10"
b=5
c=int("10")+b
print(c)

#แปลงaให้เป็นfloat เป็นเลขทศนิยม
a=("10")
b=5
c=float(a)+b
print(c)