'''
Lecture 36 : การตัดสินใจในภาษา Python 3 (if else Condition)
ข้อมูลที่ใส่หลังif ต้องเป็น boolern ซึ่งจะทดสอบเพียง จริงหรือเท็จเท่านั้น หลังจาก ifต้องจบด้วย:colonเสมอ
ระบบจะออโต้tabเข้ามาให้เสมอ(*ห้ามลบtabทิ้ง)เพราะภาษาเว้นสเปซด้านหน้าในการแยก
ให้ค่าแสดงทำงานภายใต้condition if
if,elif,else 


if True:
    print("Hello condition 1")  #ถ้าจริง มันจะทำงานภายใต้blockของมัน 
print("Hello condition 2")  #กรณีเราวางอีกoutputหลังจากมันประมวลผลแรกแล้วจะกลับเข้าสํู่ประมวลผลปกติไม่ว่าจะมีโค้ด

if False:
    print("Hello condition 1")
print ("hello condition 2") #ผลขึ้นเพียงcondition2 
#เพราะถ้าเกิดเงื่อนไขข้างหลังเป็นจริง(แต่ตอนนี้เป็นเท็จอยู่)มันก็จะทำงานออกจากเงื่อนไขแรก

''' 
#ตัวอย่าง
money=1000
if money>500:
    print("Kfc")
else:
    print("so sad !! T_T")
print("Bye bye") #กรณีที่ค่าเป็นTrueแบบนี้ ผลออกมาตามเงื่่อนไขแรกอ่านค่าkfc elseตรงนั้นมันจะไม่สนใจเลย
#มันจะไปทำงานbyebyeแทน เพราะว่า elseจะทำงานก็ต่อเมื่อเงิื่อนไขข้างบนมันเป็นเท็จ แล้วกลับมาทำงานด้านนอกต่อ