'''
Lecture 20 : การใช้งานข้อมูลเชิงตรรกะ (Boolean)
มีค่าความจริงเพียง 2 ค่า คือ True และ False
ตัวเชื่อมตรรกะ (Logical Operator) มี 3 ตัว คือ and, or
and ข้อมูลจะเป็นจริง เมื่อซ้าย และ ขวา เป็นจริงทั้งคู่ เช่น โปรโมชั่นเครื่องเก่าแลกใหม่
เงื่อนไข: มือถือของคุณต้องเปิดหน้าจอติด และจะต้องไม่มีรอยแตก และแบตไม่เสื่อม 

ถ้าเกิดมือถือเราเปิดหน้าจอติด และไม่มีรอยแตก แต่แบตเสื่อม==แลกเครื่องใหม่ไม่ได้
or ข้อมูลตรงฝั่งใดฝั่งหนึ่งเป็นจริงก็จะเป็นจริง เช่น โปรโมชั่นแลกมือถือใหม่
เงื่อนไข: มือถือของคุณจะต้องเป็นซัมซุง หรือ apple หรือ huawei ถึงจะแลกเครื่องใหม่ได้
ถ้าเกิดมือถือของเราเป็นไอโฟนapple==แลกเครื่องใหม่ได้
'''
print(type(True))
print(True and True)
print(True and False)
print(True or True)
print(True or False)