'''
Lecture 29 : การใช้งานตัวดำเนินการแบบ Assignment operator
=(เครื่องหมายเท่ากับ)ถูกใช้เมื่อต้องการให้เชื่อมโยง
''' 

'''
a=10
b=5
c=a+b
b=10
print(b) #คำตอบได้10 เพราะเป็นการกำหนดค่าที่เปลี่ยนไปเรื่อยๆเป็นค่าล่าสุด
'''
'''
a=10
b=12
a+=5 #เครื่องหมาย+=มีค่าความหมายคือ a=a+5 มีค่าเท่ากับ a=10+5
a+=-1#เครื่ืองหมาย+=-1 มีค่าความหมายคือ a=a-1 มีค่่่าเท่ากับaปัจจุบันคือ15-1 ตอบ14
print(a) #คำตอบได้15 เพราะว่า 10+=5 =15
'''

#การลดรูป
money=1000 #money=1000
money-=50 #money=money-50
money-=20 #money=money-20
print(money)
