'''
Lecture 28 : การใช้งานตัวดำเนินการทางตรรกะ
keyword: and or not ที่สำคัญคือเครื่องหมาย > มากกว่า, <(น้อยกว่า),==(มีค่าเท่ากับ),!=(มีค่าไม่เท่ากับ)
>= (มากกว่าหรือเท่ากับ), <=(น้อยกว่าหรือเท่ากับ)


age=31
print("สวัสดีค่ะ คุณอายุเกินกว่าจะเข้าร้านนี่ไหม?") #เราสามารถใส่,ลูกน้ำคั่นได้หรือจะใช้printอีกบรรทัดก็ได้ไม่มีกฏตายตัว
print(age>18) #ageคือ31>18 ผลคือเป็นจริง 


x=True
y=False
z=x and y #ใช้และ and พอค่าจริงอันไม่จริงอัน จะแสดงค่าว่า falseเสมอ
print(z)
'''
'''
x=True
y=False
z=x or y #ใช้หรือ or ค่าจะเปลี่ยนเป็น True
print(z)
'''
'''
a=10
b=5
c=a>b
print(c) #true มาจากตัวc เพราะa มีค่า10ซึ่งมากกว่าbที่มีค่า5
'''


a=int(input("enter your num"))
b=int(input("enter your num"))
c=a>b
print(c)