'''
Lecture 50 : การสร้าง – ใช้งานฟังก์ชันในภาษา Python 3
สร้างฟังก์ชั่นการบวก,ลบ,คูณ,หาร
'''

#ฟังก์ชั่นในการบวก
def addNumber(x,y): #เราประกาศตัวแปรตัวนึงซึ่ง addNumberสามารถรับตัวแปรได้สองตัว ข้อมูลตัวแรกถูกเก็บไว้ในตัวแปรx ตัวที่สองเก็บไว้ในตัวแปรy
    print(x+y) #ภายในฟังก์ชั่นทำงานโดยการปริ์นท์ x+y ในบรรทัดนี้ยังไม่ได้บวกกันจริงๆ นี่คือการประกาศ
addNumber(500,10) #ในบรรทัดนี่คือการใช้งานจริงของฟังก์ชั่น ข้อมูลต่างๆจะแทนเมื่อเราเรียกใช้งาน

#ฟังก์ชั่นในการลบ
def deletionNumber(x,y):
    print(x-y)
deletionNumber(500,10)

#ฟังก์ชั่นในการคูณ
def multiplying(x,y):
    print(x*y)
multiplying(500,10)

#ฟังก์ชั่นในการหาร
def divisionNumber(x,y):
    print(x//y) #เครื่องหมายหารแบบปัดเศษ
divisionNumber(500,10)