'''
Exercise 5 : ปฏิบัติการพัฒนาโปรแกรมที่ใช้งานได้จริง และ ข้อมูล
1.ตั้งชื่อไฟล์ Exercise5_1_ชื่อ_ตัวอักษรแรกของนามสกุล.py
"ให้ผู้เรียนลองใช้งานประโยชน์จากตัวแปร และ ตัวดำเนินการ รวมถึงข้อมูลสร้างโปรแกรมสำคัญคำนวณเลข 
โดยจะมีตัวเลขทั้งหมด 2 ตัว นำมาทำการ บวก ลบ คูณ และ หารกัน 
โดยให้แสดงคำตอบออกมาในรูปแบบด้านล่าง โดยตัวเลขสามารถเป็นตัวเลขอะไรก็ได้ที่ผู้ใช้งานต้องการ 
โดยการเปลี่ยนตัวเลขใหม่นั้นให้ผู้ใช้งานแก้ไขโค้ดให้น้อยที่สุด"
'''
#ส่งการบ้าน

print("-------Welcome to caculator----------")
print()
x=int(input("Enter your number"))
y=int(input("Enter your number"))
result1=(x+y)
result2=(x-y)
result3=(x*y)
result4=(x/y)
print(x,("+"),y,("="),result1)
print(x,("-"),y,("="),result2)
print(x,("*"),y,("="),result3)
print(x,("/"),y,("="),result4)
print()
print("-------Thank you for using us----------")